out/person/augustus-de-morgan/augustus-de-morgan.org.html
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>person/augustus-de-morgan/augustus-de-morgan.org</title>
</head>
<body>
<pre>#+title: augustus de morgan

* relational algebra

  - composition of functions
    is a special case of composition of relations

  - conj is relation composition

  - beginning with Augustus De Morgan,
    the traditional form of reasoning with by syllogism
    has been subsumed by relational logical expressions
    and their composition.

* augustus-de-morgan-and-the-logic-of-relations

*** intro

    - de morgan&apos;s motive
      an analysis of propositions which turned all
      categorical propositions into relational propositions;
      and the resulting attempt to work out syllogistic logic
      within the framework of the logic of relations

* (1860) On the Syllogism: IV, and on the Logic of Relations

* (Vaughan Pratt) Origins of the Calculus of Binary Relations
</pre>
</body>
</html>
